{
    "title": "Geç Dönem İslam Devletleri (1300–1900)",
    "content": [
        {
            "section": "Giriş",
            "text": [
                "Altın Çağ'ın ardından İslam dünyası, coğrafi olarak geniş ama siyasi olarak daha parçalı bir yapıya sahipti. Bu dönemde farklı bölgelerde ortaya çıkan devletler, kendi çevrelerinde düzeni sağlama, kültürü geliştirme, şehirleşmeyi güçlendirme ve ticareti canlı tutma gibi roller üstlendiler. 14. yüzyıldan 19. yüzyılın sonlarına kadar süren bu dönem, İslam medeniyetinin bölgesel çeşitlenmesinin belirginleştiği bir çağdır."
            ]
        },
        {
            "section": "1. Osmanlı Devleti (1299–1922)",
            "text": [
                "Osmanlılar, Balkanlar'dan Orta Doğu'ya, Kuzey Afrika'dan Kafkasya'ya kadar uzanan geniş bir coğrafyada uzun süre istikrar sağlayan bir devlet yapısı kurdular."
            ]
        },
        {
            "section": "a) Çok Kültürlü Yönetim Modeli",
            "text": [
                "Osmanlı yönetimi farklı dini, etnik ve kültürel toplulukları aynı idari çatı altında barındırdı. Bu yapı, uzun süreli bir düzenin korunmasında önemli rol oynadı."
            ]
        },
        {
            "section": "b) Eğitim ve Kurumlar",
            "text": [
                "Medreseler, kütüphaneler ve vakıf kurumları eğitim ve sosyal hayatın temelini oluşturdu. Bu kurumlar, dini ilimlerin yanı sıra hukuk, matematik ve tıp gibi alanlarda da eğitim veriyordu."
            ]
        },
        {
            "section": "c) Mimari ve Şehirleşme",
            "text": [
                "İstanbul, Bursa, Edirne ve daha birçok şehirde gelişen mimari, dönemin sanat anlayışını yansıtan önemli örnekler ortaya koydu. Camiler, külliyeler ve sosyal yapılar şehir yaşamını düzenleyen yapılardı.",
                "Osmanlılar bu dönemde İslam coğrafyasının batı bölgesinde siyasî düzeni koruyan başlıca aktörlerden biri oldular."
            ]
        },
        {
            "section": "2. Safevî Devleti (1501–1736)",
            "text": [
                "Safevîler İran merkezli güçlü bir devlet yapısı kurdular. Bölgenin siyasi ve kültürel yönünü uzun süre etkileyen bir güç oldular."
            ]
        },
        {
            "section": "a) Şehir Kültürü",
            "text": [
                "Safevî döneminde özellikle İsfahan, sanat ve mimarinin geliştiği bir merkez haline geldi. Meydanlar, saraylar ve köprüler dönemin estetik anlayışını belirginleştirir."
            ]
        },
        {
            "section": "b) Ekonomik ve Siyasi Yapı",
            "text": [
                "Ticaret yollarını düzenleme, bölgesel idareyi güçlendirme ve şehirleşmeyi destekleme Safevî yönetiminin temel çalışmaları arasındaydı.",
                "Safevîler, İslam dünyasının doğu bölgesinde siyasi dengenin önemli bir parçasıydı."
            ]
        },
        {
            "section": "3. Timurîler (14.–15. yüzyıllar)",
            "text": [
                "Timurîler, Orta Asya ve İran coğrafyasında etkili oldular. Siyasi hâkimiyetleri sınırlı süreli olsa da kültürel etkileri uzun soluklu oldu."
            ]
        },
        {
            "section": "a) Bilim ve Sanatın Korunması",
            "text": [
                "Timurî sarayları matematik, astronomi ve tarih alanındaki çalışmaları destekledi. Semerkant ve Herat şehirleri dönemin en önemli ilim ve sanat merkezlerinden biri hâline geldi."
            ]
        },
        {
            "section": "b) Mimari Gelişim",
            "text": [
                "Timurî mimarisi, kubbeler, çiniler ve geniş avlularıyla tanınır. Bu stil, sonraki yüzyıllarda birçok bölgeyi etkiledi."
            ]
        },
        {
            "section": "4. Babür İmparatorluğu (1526–1857)",
            "text": [
                "Babürler, Hindistan coğrafyasında güçlü bir devlet kurdular ve bölgenin kültürel yapısını derinden etkilediler."
            ]
        },
        {
            "section": "a) Sanat ve Mimari",
            "text": [
                "Tac Mahal gibi dünya çapında tanınan birçok eser Babür döneminde inşa edildi. Bu yapıların mimarisi, Orta Asya, İran ve Hint kültürlerinin sentezinden oluşur."
            ]
        },
        {
            "section": "b) Yönetim ve Toplumsal Düzen",
            "text": [
                "Babürler, bölgedeki farklı toplulukları aynı idari sistem içinde birleştirmeye çalıştı. Bu çok kültürlü yapı bölgenin sosyal çeşitliliğine katkı sağladı."
            ]
        },
        {
            "section": "5. Kuzey Afrika, Arabistan ve Orta Asya'daki Bölgesel Yapılar",
            "text": [
                "Geç dönem İslam tarihinin yalnızca büyük imparatorluklardan ibaret olmadığını vurgulamak önemlidir. Aynı dönemde:",
                "-Kuzey Afrika'da yerel hanedanlıklar,",
                "-Orta Asya'da çeşitli Türk hanlıkları,",
                "-Arap Yarımadası'nda bölgesel yönetimler",
                "bulundukları bölgelerde istikrarı sağlama ve toplum düzenini koruma görevlerini üstlendiler.",
                "Bu yapılar, kendi iç dinamiklerine göre şekillenen, fakat aynı medeniyet alanının parçası olan yönetimlerdi."
            ]
        },
        {
            "section": "Genel Değerlendirme",
            "text": [
                "Geç dönem İslam devletleri:",
                "-Farklı coğrafyalara yayılmış,",
                "-Çok kültürlü yapılar oluşturmuş,",
                "-İlim, sanat, mimari ve yönetim alanlarında kalıcı eserler bırakmış,",
                "-Bölgesel istikrar sağlayan siyasi organizasyonlar",
                "olarak tarihte önemli bir yer tutar.",
                "Bu dönem, İslam medeniyetinin tek merkezli bir yapıdan, çok merkezli ve geniş bir kültürel çeşitliliğe sahip bir modele evrildiğini gösterir. Bu çeşitlilik, medeniyetin zenginleşmesine ve farklı bölgelerin kendi özgün katkılarını ortaya koymasına imkan sağlamıştır."
            ]
        }
    ]
}