{
    "title": "The Prophetic Period (610–632)",
    "content": [
        {
            "section": "Introduction",
            "text": [
                "The prophetic period of Prophet Muhammad is divided into two major phases: one in Mecca and one in Medina. This period marks not only a change in faith but also the beginning of society's transition to a new structure centered on justice, solidarity, and morality."
            ]
        },
        {
            "section": "A) The Meccan Period (610–622)",
            "text": []
        },
        {
            "section": "1. The First Revelation and Beginning",
            "text": [
                "As Prophet Muhammad approached the age of forty, he was in a period of intense contemplation about the meaning of life and the direction of society. The time he spent in contemplation in Hira served as preparation for the arrival of the first revelation. The first revelation that came in 610 was a beginning that fundamentally changed both his life and the future of Meccan society."
            ]
        },
        {
            "section": "2. The First Muslims and Secret Preaching",
            "text": [
                "In the early years of prophethood, the call was made within a narrow circle. This process, which began among his closest family members and friends, was conducted secretly for a time due to oppressive social pressure. Those who became Muslim during this period came from different segments of society but shared a common search for justice and truth."
            ]
        },
        {
            "section": "3. Social Pressures and Boycott Years",
            "text": [
                "In Meccan society, polytheism was intertwined with the economic order. As the new teaching questioned this order, pressure on Muslims increased. The boycott years were a difficult period when Muslims were socially and economically excluded. Despite this, their persistence in their faith led to the formation of a strong spirit of solidarity."
            ]
        },
        {
            "section": "4. Migration to Abyssinia",
            "text": [
                "The refuge of some Muslims in Abyssinia due to increasing pressure was an important step in terms of both religious freedom and the search for peace. This event set an example of relationships that could be established between different societies based on trust and justice."
            ]
        },
        {
            "section": "5. Final Years in Mecca",
            "text": [
                "During this period, Prophet Muhammad continued his preaching without retaliating physically or verbally despite all the pressure. The Meccan period went down in history as a process of patience, resistance, faith, and moral determination."
            ]
        },
        {
            "section": "B) The Medinan Period (622–632)",
            "text": []
        },
        {
            "section": "1. The Hijra and Building a New Society",
            "text": [
                "Prophet Muhammad's migration to Medina opened the door to a period when the institutional structure of Islamic society began to take shape. Various communities and religious groups existed in Medina. The Hijra created an opportunity to establish an order where different elements could live together in peace in the same city."
            ]
        },
        {
            "section": "2. The Constitution of Medina",
            "text": [
                "One of the first steps upon settling in Medina was the preparation of a constitution encompassing all communities living in the city. This document was based on security, justice, and social solidarity. A structure was established where different religions and tribes could coexist with their rights protected. This constitution is considered by historians as one of the early examples of social contracts."
            ]
        },
        {
            "section": "3. Brotherhood System and Solidarity",
            "text": [
                "The new society established in Medina was built on mutual aid and solidarity. The brotherhood practice between the Muhajirun and Ansar strengthened not only economic sharing but also emotional and social harmony. This practice created a new foundation of trust among individuals."
            ]
        },
        {
            "section": "4. Defensive Conflicts",
            "text": [
                "The conflicts during the Medinan period were necessary defenses for the security of the newly established society. The purpose in these events was to repel an attack and protect society's existence. There is no aggressive expansion intention in any text; all narrative is shaped in the context of defense."
            ]
        },
        {
            "section": "5. Social Transformation and Teaching",
            "text": [
                "Throughout the Medinan years, many regulations were made such as organizing worship, strengthening social relations, and developing justice principles. A new culture was built in all areas of society based on morality, mercy, and fairness."
            ]
        },
        {
            "section": "6. The Farewell Sermon and Final Messages",
            "text": [
                "The Farewell Sermon given at the final stage of the prophetic period is a universal message centered on human values. His words, which disregarded distinctions of race, class, and origin, left an emphasis on rights, justice, and equality as a strong legacy to history."
            ]
        },
        {
            "section": "General Assessment",
            "text": [
                "The prophetic period is not just a religious transformation; it is also a process of fundamental renewal in human relations, social structure, and values. Patience and determination came to the fore in Mecca, while order and social construction were prominent in Medina. Together, these two phases present a holistic structure that forms the foundation of Islamic history."
            ]
        }
    ]
}