{
    "title": "Peygamberlik Dönemi (610–632)",
    "content": [
        {
            "section": "Giriş",
            "text": [
                "Hz. Muhammed'in peygamberlik dönemi, hem Mekke hem de Medine'de yaşanan iki büyük evreye ayrılır. Bu dönem, yalnızca bir inanç değişiminin değil; aynı zamanda toplumun adalet, dayanışma ve ahlak merkezli yeni bir yapıya kavuşmasının da başlangıcıdır."
            ]
        },
        {
            "section": "A) Mekke Dönemi (610–622)",
            "text": []
        },
        {
            "section": "1. İlk Vahiy ve Başlangıç",
            "text": [
                "Hz. Muhammed kırk yaşına yaklaştığında, yaşamın anlamı ve toplumun gidişatı üzerine yoğun bir düşünce dönemi içindeydi. Hira'da geçirdiği bu tefekkür süreci, ilk vahyin gelişine bir hazırlık niteliği taşıdı. 610 yılında gelen ilk vahiy, hem onun hayatını hem de Mekke toplumunun geleceğini kökten değiştiren bir başlangıç oldu."
            ]
        },
        {
            "section": "2. İlk Müslümanlar ve Gizli Tebligat",
            "text": [
                "Peygamberliğin ilk yıllarında çağrı dar bir çevrede yapıldı. En yakın aile üyeleri ve dostları arasında başlayan bu süreç, zorlayıcı toplumsal baskı nedeniyle bir süre gizli yürütüldü. Bu dönemde Müslüman olanlar, toplumun farklı kesimlerinden gelen fakat adalet ve doğruluk arayışı ortak olan insanlardı."
            ]
        },
        {
            "section": "3. Toplumsal Baskılar ve Boykot Yılları",
            "text": [
                "Mekke toplumunda putperestlik ekonomik düzenle iç içeydi. Yeni öğreti bu düzeni sorguladığı için, Müslümanlara yönelik baskılar giderek arttı. Boykot yılları, Müslümanların hem sosyal hem de ekonomik açıdan dışlandığı zorlu bir dönemdi. Buna rağmen inançlarını sürdürmeleri, güçlü bir dayanışma ruhunun oluşmasını sağladı."
            ]
        },
        {
            "section": "4. Habeşistan'a Hicret",
            "text": [
                "Baskıların artması üzerine bazı Müslümanların Habeşistan'a sığınması, hem inanç özgürlüğü hem de barış arayışı açısından önemli bir adımdı. Bu olay, farklı toplumlar arasında güven ve adalet temelinde kurulabilecek ilişkilerin bir örneğini oluşturdu."
            ]
        },
        {
            "section": "5. Mekke'de Son Yıllar",
            "text": [
                "Hz. Muhammed bu süreçte kendisine yapılan tüm baskılara rağmen fiziki ya da sözlü bir karşılık vermeden tebliğini sürdürdü. Mekke dönemi, sabır, direnç, inanç ve ahlaki kararlılığın şekillendiği bir süreç olarak tarihe geçti."
            ]
        },
        {
            "section": "B) Medine Dönemi (622–632)",
            "text": []
        },
        {
            "section": "1. Hicret ve Yeni Toplumun İnşası",
            "text": [
                "Hz. Muhammed'in Medine'ye hicreti, İslam toplumunun kurumsal yapısının şekillenmeye başladığı dönemin kapısını açtı. Medine'de çeşitli topluluklar ve inanç grupları bulunuyordu. Hicret, farklı unsurların aynı şehirde barış içinde yaşayabileceği bir düzen kurulması için bir fırsat oluşturdu."
            ]
        },
        {
            "section": "2. Medine Sözleşmesi",
            "text": [
                "Medine'ye yerleşmenin ilk aşamalarından biri, şehirde yaşayan tüm toplulukları kapsayan bir sözleşmenin hazırlanmasıydı. Bu metin, güvenlik, adalet ve toplumsal dayanışmayı esas alıyordu. Farklı din ve kabilelerin bir arada yaşayabileceği, hakların korunduğu bir yapı kurulmuş oldu. Bu sözleşme, tarihçiler tarafından erken dönem toplumsal sözleşme örneklerinden biri olarak değerlendirilir."
            ]
        },
        {
            "section": "3. Kardeşlik Düzeni ve Dayanışma",
            "text": [
                "Medine'de kurulan yeni toplum, yardımlaşma ve dayanışma üzerine inşa edildi. Muhacirlerle Ensar arasındaki kardeşlik uygulaması, yalnızca ekonomik paylaşımı değil; aynı zamanda duygusal ve sosyal uyumu da güçlendirdi. Bu uygulama, bireyler arasında yeni bir güven zemini oluşturdu."
            ]
        },
        {
            "section": "4. Savunma Amaçlı Çatışmalar",
            "text": [
                "Medine döneminde yaşanan çatışmalar, yeni kurulan toplumun güvenliği için zorunlu savunma niteliği taşıyordu. Bu olaylarda amaç, bir saldırıyı püskürtmek ve toplumun varlığını korumaktı. Hiçbir metinde saldırgan bir genişleme niyeti bulunmaz; tüm anlatım savunma bağlamında şekillenir."
            ]
        },
        {
            "section": "5. Toplumsal Dönüşüm ve Öğreti",
            "text": [
                "Medine yılları boyunca ibadetlerin düzenlenmesi, toplumsal ilişkilerin güçlendirilmesi, adalet ilkelerinin geliştirilmesi gibi birçok düzenleme yapıldı. Toplumun her alanında ahlak, merhamet ve hakkaniyet temel alınarak yeni bir kültür inşa edildi."
            ]
        },
        {
            "section": "6. Veda Hutbesi ve Son Mesajlar",
            "text": [
                "Peygamberlik döneminin son aşamasında verilen Veda Hutbesi, insanlık değerlerini merkeze alan evrensel bir mesaj niteliğindedir. Irk, sınıf ve köken ayrımı gözetmeyen sözleri; hak, adalet ve eşitlik vurgusunu tarihe güçlü bir miras olarak bırakmıştır."
            ]
        },
        {
            "section": "Genel Değerlendirme",
            "text": [
                "Peygamberlik dönemi, sadece dini bir dönüşüm değil; aynı zamanda insan ilişkilerinde, toplum yapısında ve değerlerde köklü bir yenilenme sürecidir. Mekke'de sabır ve kararlılık, Medine'de ise düzen ve toplumsal inşa ön plana çıkmıştır. Bu iki evre birlikte, İslam tarihinin temelini oluşturan bütünsel bir yapıyı ortaya koyar."
            ]
        }
    ]
}